/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   Pong.cpp                                           :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: jewlee <jewlee@student.42.fr>              +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2025/02/17 02:05:05 by minhulee          #+#    #+#             */
/*   Updated: 2025/02/27 15:07:16 by jewlee           ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

// Command: PONG
// Parameters: [<server>] <token>

// 해당 클라이언트의 연결이 정상적임을 확인합니다~
// PING에 대한 응답인 PONG이 정상적이지 않은 경우, 해당 클라를 종료시킵니다~